final-benchmarks/ec2.m3.2xl.0.uniform30.0/70/ycsb-results
java -cp postgresql-9.4.1212.jre7.jar:/home/ubuntu/ycsb/jdbc-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jdbc-binding-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/core-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/commons-pool-1.5.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform30 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.89.97.110:26267/test,jdbc:postgresql://35.162.118.230:26267/test,jdbc:postgresql://35.167.188.137:26267/test,jdbc:postgresql://52.39.134.13:26267/test,jdbc:postgresql://52.89.116.204:26267/test -s -threads 70 -t
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform30 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.89.97.110:26267/test,jdbc:postgresql://35.162.118.230:26267/test,jdbc:postgresql://35.167.188.137:26267/test,jdbc:postgresql://52.39.134.13:26267/test,jdbc:postgresql://52.89.116.204:26267/test -s -threads 70 -tYCSB Client 0.13.0-SNAPSHOT

Loading workload...
Starting test.
2017-03-13 10:25:01:696 0 sec: 0 operations; est completion in 0 seconds 
Adding shard node URL: jdbc:postgresql://52.89.97.110:26267/test
Adding shard node URL: jdbc:postgresql://52.89.97.110:26267/test
Adding shard node URL: jdbc:postgresql://52.89.97.110:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.162.118.230:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test

Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/testDBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test

Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://35.167.188.137:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test

Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.39.134.13:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://52.89.116.204:26267/test

Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-03-13 10:25:11:655 10 sec: 30524 operations; 3052.4 current ops/sec; est completion in 23 seconds [READ: Count=9092, Max=87871, Min=856, Avg=2407.63, 90=3419, 99=9711, 99.9=52959, 99.99=87679] [UPDATE: Count=21471, Max=244351, Min=5912, Avg=30884.27, 90=43743, 99=60479, 99.9=88831, 99.99=113023] 
2017-03-13 10:25:21:654 20 sec: 60699 operations; 3017.5 current ops/sec; est completion in 13 seconds [READ: Count=8949, Max=44031, Min=858, Avg=2267.4, 90=3311, 99=9615, 99.9=20991, 99.99=34111] [UPDATE: Count=21206, Max=95039, Min=5744, Avg=32014.72, 90=45631, 99=60575, 99.9=76799, 99.99=84095] 
2017-03-13 10:25:31:654 30 sec: 90770 operations; 3007.1 current ops/sec; est completion in 4 seconds [READ: Count=9044, Max=22879, Min=851, Avg=2184.36, 90=3203, 99=7539, 99.9=15095, 99.99=22127] [UPDATE: Count=21014, Max=486143, Min=6716, Avg=32350.42, 90=46207, 99=60671, 99.9=74559, 99.99=84799] 
2017-03-13 10:25:34:797 33 sec: 100000 operations; 2937.62 current ops/sec; [READ: Count=2732, Max=22895, Min=847, Avg=2190.83, 90=3243, 99=8239, 99.9=14255, 99.99=22895] [CLEANUP: Count=70, Max=383, Min=78, Avg=119.91, 90=173, 99=276, 99.9=383, 99.99=383] [UPDATE: Count=6492, Max=81407, Min=2294, Avg=29244.45, 90=42655, 99=61599, 99.9=76031, 99.99=79295] 
[OVERALL], RunTime(ms), 33141.0
[OVERALL], Throughput(ops/sec), 3017.4104583446488
[TOTAL_GCS_PS_Scavenge], Count, 3.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 22.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.06638303008358228
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 3.0
[TOTAL_GC_TIME], Time(ms), 22.0
[TOTAL_GC_TIME_%], Time(%), 0.06638303008358228
[READ], Operations, 29817.0
[READ], AverageLatency(us), 2277.9591843579165
[READ], MinLatency(us), 847.0
[READ], MaxLatency(us), 87871.0
[READ], 95thPercentileLatency(us), 4415.0
[READ], 99thPercentileLatency(us), 8975.0
[READ], Return=OK, 29817
[CLEANUP], Operations, 70.0
[CLEANUP], AverageLatency(us), 119.91428571428571
[CLEANUP], MinLatency(us), 78.0
[CLEANUP], MaxLatency(us), 383.0
[CLEANUP], 95thPercentileLatency(us), 187.0
[CLEANUP], 99thPercentileLatency(us), 276.0
[UPDATE], Operations, 70183.0
[UPDATE], AverageLatency(us), 31513.1465169628
[UPDATE], MinLatency(us), 2294.0
[UPDATE], MaxLatency(us), 486143.0
[UPDATE], 95thPercentileLatency(us), 50015.0
[UPDATE], 99thPercentileLatency(us), 60703.0
[UPDATE], Return=OK, 70183